wrk/replicas_res/get_wrk.txt
thread addr: 127.0.0.1:8080
thread addr: 127.0.0.1:8081
thread addr: 127.0.0.1:8082
thread addr: 127.0.0.1:8080
thread addr: 127.0.0.1:8081
thread addr: 127.0.0.1:8082
Running 30s test @ http://127.0.0.1:8080
  6 threads and 1024 connections
  Thread calibration: mean lat.: 1.110ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.127ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.418ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.247ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.363ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.343ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.93ms  601.48us  15.38ms   96.57%
    Req/Sec   422.08    228.02     1.33k    61.87%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    0.89ms
 75.000%    1.14ms
 90.000%    1.31ms
 99.000%    3.15ms
 99.900%    8.90ms
 99.990%   11.02ms
 99.999%   15.38ms
100.000%   15.38ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.249     0.000000            1         1.00
       0.464     0.100000         4654         1.11
       0.563     0.200000         9276         1.25
       0.677     0.300000        13899         1.43
       0.769     0.400000        18589         1.67
       0.887     0.500000        23178         2.00
       0.940     0.550000        25533         2.22
       0.974     0.600000        27804         2.50
       1.023     0.650000        30100         2.86
       1.096     0.700000        32441         3.33
       1.143     0.750000        34786         4.00
       1.160     0.775000        35931         4.44
       1.179     0.800000        37100         5.00
       1.199     0.825000        38202         5.71
       1.231     0.850000        39371         6.67
       1.267     0.875000        40518         8.00
       1.289     0.887500        41104         8.89
       1.313     0.900000        41688        10.00
       1.334     0.912500        42258        11.43
       1.353     0.925000        42831        13.33
       1.374     0.937500        43441        16.00
       1.384     0.943750        43718        17.78
       1.395     0.950000        43988        20.00
       1.413     0.956250        44289        22.86
       1.439     0.962500        44570        26.67
       1.472     0.968750        44865        32.00
       1.495     0.971875        45001        35.56
       1.527     0.975000        45149        40.00
       1.598     0.978125        45292        45.71
       1.768     0.981250        45435        53.33
       2.115     0.984375        45580        64.00
       2.329     0.985938        45652        71.11
       2.545     0.987500        45725        80.00
       2.859     0.989062        45797        91.43
       3.303     0.990625        45869       106.67
       3.811     0.992188        45942       128.00
       4.099     0.992969        45978       142.22
       4.323     0.993750        46014       160.00
       4.539     0.994531        46050       182.86
       4.815     0.995313        46086       213.33
       5.243     0.996094        46123       256.00
       5.515     0.996484        46141       284.44
       5.799     0.996875        46159       320.00
       6.047     0.997266        46177       365.71
       6.399     0.997656        46195       426.67
       6.787     0.998047        46213       512.00
       7.187     0.998242        46222       568.89
       7.611     0.998437        46231       640.00
       8.207     0.998633        46240       731.43
       8.543     0.998828        46250       853.33
       8.895     0.999023        46258      1024.00
       9.239     0.999121        46263      1137.78
       9.415     0.999219        46267      1280.00
       9.687     0.999316        46272      1462.86
       9.839     0.999414        46276      1706.67
       9.999     0.999512        46281      2048.00
      10.327     0.999561        46283      2275.56
      10.391     0.999609        46285      2560.00
      10.535     0.999658        46288      2925.71
      10.639     0.999707        46290      3413.33
      10.719     0.999756        46292      4096.00
      10.767     0.999780        46293      4551.11
      10.919     0.999805        46294      5120.00
      10.999     0.999829        46296      5851.43
      11.015     0.999854        46298      6826.67
      11.015     0.999878        46298      8192.00
      11.015     0.999890        46298      9102.22
      11.863     0.999902        46299     10240.00
      11.903     0.999915        46300     11702.86
      11.903     0.999927        46300     13653.33
      11.991     0.999939        46301     16384.00
      11.991     0.999945        46301     18204.44
      11.991     0.999951        46301     20480.00
      12.775     0.999957        46302     23405.71
      12.775     0.999963        46302     27306.67
      12.775     0.999969        46302     32768.00
      12.775     0.999973        46302     36408.89
      12.775     0.999976        46302     40960.00
      15.383     0.999979        46303     46811.43
      15.383     1.000000        46303          inf
#[Mean    =        0.929, StdDeviation   =        0.601]
#[Max     =       15.376, Total count    =        46303]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  94245 requests in 30.85s, 5.98MB read
  Socket errors: connect 5, read 0, write 0, timeout 13786
  Non-2xx or 3xx responses: 7591
Requests/sec:   3054.92
Transfer/sec:    198.41KB