wrk/replicas_res/put_wrk.txt
thread addr: 127.0.0.1:8080
thread addr: 127.0.0.1:8081
thread addr: 127.0.0.1:8082
thread addr: 127.0.0.1:8080
thread addr: 127.0.0.1:8081
thread addr: 127.0.0.1:8082
Running 30s test @ http://127.0.0.1:8080
  6 threads and 1024 connections
  Thread calibration: mean lat.: 1.449ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.260ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.437ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.345ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.424ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.327ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.95ms  573.92us  17.10ms   93.07%
    Req/Sec   344.71    129.48     1.00k    58.44%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    0.91ms
 75.000%    1.15ms
 90.000%    1.32ms
 99.000%    3.07ms
 99.900%    7.74ms
 99.990%   11.26ms
 99.999%   17.12ms
100.000%   17.12ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.253     0.000000            1         1.00
       0.484     0.100000         3770         1.11
       0.584     0.200000         7516         1.25
       0.700     0.300000        11262         1.43
       0.791     0.400000        15028         1.67
       0.908     0.500000        18766         2.00
       0.952     0.550000        20634         2.22
       0.995     0.600000        22487         2.50
       1.052     0.650000        24384         2.86
       1.104     0.700000        26260         3.33
       1.148     0.750000        28113         4.00
       1.171     0.775000        29046         4.44
       1.198     0.800000        30013         5.00
       1.227     0.825000        30917         5.71
       1.257     0.850000        31870         6.67
       1.288     0.875000        32796         8.00
       1.305     0.887500        33289         8.89
       1.320     0.900000        33742        10.00
       1.338     0.912500        34206        11.43
       1.361     0.925000        34682        13.33
       1.388     0.937500        35143        16.00
       1.403     0.943750        35370        17.78
       1.423     0.950000        35609        20.00
       1.445     0.956250        35842        22.86
       1.471     0.962500        36077        26.67
       1.512     0.968750        36306        32.00
       1.539     0.971875        36427        35.56
       1.579     0.975000        36541        40.00
       1.646     0.978125        36658        45.71
       1.863     0.981250        36773        53.33
       2.243     0.984375        36890        64.00
       2.403     0.985938        36949        71.11
       2.657     0.987500        37007        80.00
       2.897     0.989062        37066        91.43
       3.169     0.990625        37124       106.67
       3.639     0.992188        37183       128.00
       3.911     0.992969        37212       142.22
       4.175     0.993750        37242       160.00
       4.391     0.994531        37271       182.86
       4.687     0.995313        37300       213.33
       5.207     0.996094        37329       256.00
       5.403     0.996484        37344       284.44
       5.651     0.996875        37358       320.00
       5.879     0.997266        37373       365.71
       6.195     0.997656        37388       426.67
       6.379     0.998047        37402       512.00
       6.763     0.998242        37410       568.89
       6.939     0.998437        37417       640.00
       7.279     0.998633        37425       731.43
       7.563     0.998828        37432       853.33
       7.779     0.999023        37439      1024.00
       7.923     0.999121        37443      1137.78
       8.095     0.999219        37446      1280.00
       8.159     0.999316        37450      1462.86
       8.287     0.999414        37454      1706.67
       8.623     0.999512        37457      2048.00
       9.031     0.999561        37459      2275.56
       9.383     0.999609        37461      2560.00
       9.887     0.999658        37463      2925.71
      10.079     0.999707        37465      3413.33
      10.263     0.999756        37466      4096.00
      10.311     0.999780        37467      4551.11
      10.455     0.999805        37468      5120.00
      10.687     0.999829        37469      5851.43
      11.079     0.999854        37470      6826.67
      11.263     0.999878        37471      8192.00
      11.263     0.999890        37471      9102.22
      11.367     0.999902        37472     10240.00
      11.367     0.999915        37472     11702.86
      11.375     0.999927        37473     13653.33
      11.375     0.999939        37473     16384.00
      11.375     0.999945        37473     18204.44
      12.255     0.999951        37474     20480.00
      12.255     0.999957        37474     23405.71
      12.255     0.999963        37474     27306.67
      12.255     0.999969        37474     32768.00
      12.255     0.999973        37474     36408.89
      17.119     0.999976        37475     40960.00
      17.119     1.000000        37475          inf
#[Mean    =        0.946, StdDeviation   =        0.574]
#[Max     =       17.104, Total count    =        37475]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  75283 requests in 30.00s, 4.81MB read
  Socket errors: connect 5, read 0, write 0, timeout 13653
  Non-2xx or 3xx responses: 29
Requests/sec:   2509.32
Transfer/sec:    164.20KB